package org.itstep.task01;

// @formatter:off
/**
 * Задание 1
 *
 * 1) Создайте класс Employee.
 * 2) Добавьте поля: fullName (ФИО), paymentType (вид оплаты), payment (сумма)
 * 3) Создайте конструктор с тремя параметрами
 * 4) Реализуйте геттеры и сеттеры
 * 5) Переопределите метод toString(), который должен возвращать данные вида: ФИО | Вид оплаты | Сумма
 * 6) Раскомментируйте код в методе main()
 *
 * Запустите, ожидается вывод:

    ФИО    |  Вид оплаты  |  Сумма
  ---------|--------------|------------
   Иванов  | ставка       | 3000.0 грн
   Сидоров | почасовая    |  800.0 грн
   Петров  | сдельная     | 5500.0 грн
   Итого   |              | 9300.0 грн

 */
// @formatter:on

public class Main {
    public static void main(String[] args) {
        // FIXME: Раскомментируйте код
//        Employee[] employees = { // Создаем массив сотрудников
//                new Employee("Иванов",  PaymentTypes.RATE, 3000),
//                new Employee("Сидоров", PaymentTypes.HOURLY, 800),
//                new Employee("Петров",  PaymentTypes.JOB_PRICE, 5500)
//        };
//        System.out.println("  ФИО    |  Вид оплаты  |  Сумма\n---------|--------------|------------");
//        double sum = 0;
//        for (Employee employee : employees) {
//            System.out.println(employee);
//            sum += employee.getPayment();
//        }
//        System.out.println(" Итого   |              | " + sum + " грн");
    }
}
