package org.itstep.task05;

// @formatter:off
/**
 * Задание 5
 *
 * 1) Создайте класс EmployeeAndOffshore
 * 2) Добавьте приватное поле inOffshore
 * 3) Реализуйте нужные конструкторы
 * 4) Реализуйте геттер и сеттер для inOffshore
 * 5) Переопределите метод toString() для вывода данных о сотруднике с учетом работы в офшоре
 * 6) Раскомментируйте код в методе main()
 *
 * Запустите, ожидается вывод:

 ФИО    |  Налог, % | Сумма (грн) | К оплате (грн)
 ---------|-----------|-------------|---------------
 Иванов  |        0% | 3000.0      | 3000.0
 Сидоров |       20% | 800.0       | 320.0 / 40.0
 Петров  |       20% | 5500.0      | 4400.0
 Итого   |           |             | 9300.0

 */
// @formatter:on

public class Main {
    public static void main(String[] args) {
        // FIXME: Раскомментируйте код
//        Employee[] employees = {
//                new EmployeeAndOffshore("Иванов", PaymentTypes.RATE, 3000, true, true),
//                new EmployeeAndOffshore("Сидоров", PaymentTypes.HOURLY, 800, true),
//                new EmployeeAndOffshore("Петров", PaymentTypes.JOB_PRICE, 5500)
//        };
//        ((EmployeeAndTugrik)(employees[employees.length/2])).setTugrikExchange(8);
//        System.out.println("  ФИО    |  Налог, % | Сумма (грн) | К оплате (грн)\n" +
//                "---------|-----------|-------------|---------------");
//        double sum = 0;
//        for (Employee employee : employees) {
//            System.out.println(employee);
//            sum += employee.getPayment();
//        }
//        System.out.println(" Итого   |           |             | " + sum);
    }
}
